RoR/app/controllers/carts_controller.rb

DELETE FROM `carts` WHERE `carts`.`id` = 691712329
---
  def destroy
    @cart.destroy

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 691712329 LIMIT 1
---
    def set_cart
      @cart = Cart.find(params[:id])