RoR/app/controllers/clientes_controller.rb

  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save
---
INSERT INTO `clientes` (`nombre`, `apellidos`, `email`, `pass`, `created_at`, `updated_at`) VALUES ('MyString', 'MyString', 'MyString', 'MyString', '2021-06-08 22:32:10.087784', '2021-06-08 22:32:10.087784')

  def destroy
    @cliente.destroy
---
DELETE FROM `clientes` WHERE `clientes`.`id` = 980190962

    def set_cliente
      @cliente = Cliente.find(params[:id])
---
SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 980190962 LIMIT 1