RoR/app/controllers/contienes_controller.rb

SELECT `contienes`.* FROM `contienes`
---
  def index
    @contienes = Contiene.all

DELETE FROM `contienes` WHERE `contienes`.`id` = 980190962
---
  def destroy
    @contiene.destroy

SELECT `contienes`.* FROM `contienes` WHERE `contienes`.`id` = 980190962 LIMIT 1
---
    def set_contiene
      @contiene = Contiene.find(params[:id])