RoR/app/controllers/productos_controller.rb

SELECT `productos`.* FROM `productos`
---
  def index
    @productos = Producto.all

INSERT INTO `productos` (`nombre`, `stock`, `precio`, `descripcion`, `created_at`, `updated_at`) VALUES ('Pollo', 1, 9, 'Aaaaaaaaaaaaaa', '2021-06-08 22:32:10.542671', '2021-06-08 22:32:10.542671')
---
  def create
    @producto = Producto.new(producto_params)

    respond_to do |format|
      if @producto.save

DELETE FROM `productos` WHERE `productos`.`id` = 980190962
---
  def destroy
    @producto.destroy

SELECT `productos`.* FROM `productos` WHERE `productos`.`id` = 980190962 LIMIT 1
---
    def set_producto
      @producto = Producto.find(params[:id])