RoR/app/controllers/tiendas_controller.rb

  def index
    @tiendas = Tienda.all
---
SELECT `tiendas`.* FROM `tiendas`

  def create
    @tienda = Tienda.new(tienda_params)

    respond_to do |format|
      if @tienda.save
---
INSERT INTO `tiendas` (`ubicacion`, `created_at`, `updated_at`) VALUES ('MyString', '2021-06-08 22:32:10.342479', '2021-06-08 22:32:10.342479')

  def destroy
    @tienda.destroy
---
DELETE FROM `tiendas` WHERE `tiendas`.`id` = 980190962

    def set_tienda
      @tienda = Tienda.find(params[:id])
---
SELECT `tiendas`.* FROM `tiendas` WHERE `tiendas`.`id` = 980190962 LIMIT 1